<a href="https://colab.research.google.com/github/NihalShriv/ML-Libs-Learning/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/gdrive

In [ ]:
import os
os.environ['KAGGLE_CONFIG_DIR'] = "/content/gdrive/My Drive/Kaggle"

In [ ]:
!kaggle competitions download -c titanic

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.6 / client 1.5.4)
Downloading train.csv to /content
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 33.5MB/s]
Downloading test.csv to /content
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 24.3MB/s]
Downloading gender_submission.csv to /content
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 2.99MB/s]

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
gender_submission = pd.read_csv('gender_submission.csv')
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [ ]:
train.Age = train.Age.fillna(0)

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
train['Embarked'] = train.Embarked.astype('str')
train['Cabin'] = train.Cabin.astype('str')

In [ ]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
num_train = pd.DataFrame(train)
num_train['Sex'] = le.fit_transform(train['Sex'])
num_train['Embarked'] = le.fit_transform(train['Embarked'])
num_train['Cabin'] = le.fit_transform(train['Cabin'])
num_train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    147         2
1            2         1       1  ...  71.2833     81         0
2            3         1       3  ...   7.9250    147         2
3            4         1       1  ...  53.1000     55         2
4            5         0       3  ...   8.0500    147         2

[5 rows x 12 columns]

In [ ]:
cols = [col for col in num_train.columns if col not in ['Name','Ticket','PassengerId','Survived']]
data = num_train[cols]
target = num_train['Survived']
data.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0       3    1  22.0      1      0   7.2500    147         2
1       1    0  38.0      1      0  71.2833     81         0
2       3    0  26.0      0      0   7.9250    147         2
3       1    0  35.0      1      0  53.1000     55         2
4       3    1  35.0      0      0   8.0500    147         2

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    int64
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Cabin     891 non-null    int64
 7   Embarked  891 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 55.8 KB

In [ ]:
test2 = test.copy()

test2.Age = test2.Age.fillna(0)
test2.Cabin = test2.Cabin.fillna(0)
test2.Fare = test2.Fare.fillna(0)
test2['Embarked'] = test2.Embarked.astype('str')
test2['Cabin'] = test2.Cabin.astype('str')

In [ ]:
test2.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...     0        Q
1          893       3  ...     0        S
2          894       2  ...     0        Q
3          895       3  ...     0        S
4          896       3  ...     0        S

[5 rows x 11 columns]

In [ ]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
num_test = pd.DataFrame(test2)
num_test['Sex'] = le.fit_transform(test2['Sex'])
num_test['Embarked'] = le.fit_transform(test2['Embarked'])
num_test['Cabin'] = le.fit_transform(test2['Cabin'])
num_test.head()

   PassengerId  Pclass  ... Cabin  Embarked
0          892       3  ...     0         1
1          893       3  ...     0         2
2          894       2  ...     0         1
3          895       3  ...     0         2
4          896       3  ...     0         2

[5 rows x 11 columns]

In [ ]:
cols = [col for col in num_test.columns if col not in ['Name','Ticket','PassengerId']]
target_data = num_test[cols]
target_data.info()
target_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    int64
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Cabin     418 non-null    int64
 7   Embarked  418 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 26.2 KB

   Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0       3    1  34.5      0      0   7.8292      0         1
1       3    0  47.0      1      0   7.0000      0         2
2       2    1  62.0      0      0   9.6875      0         1
3       3    1  27.0      0      0   8.6625      0         2
4       3    0  22.0      1      1  12.2875      0         2

In [ ]:
from sklearn.svm import LinearSVC

x = LinearSVC()

print(x.get_params().keys())

dict_keys(['C', 'class_weight', 'dual', 'fit_intercept', 'intercept_scaling', 'loss', 'max_iter', 'multi_class', 'penalty', 'random_state', 'tol', 'verbose'])

In [ ]:
from sklearn.svm import LinearSVC

svc = LinearSVC(random_state=0, dual=False)
svc.fit(data, target)
pred = svc.predict(target_data)

In [ ]:
result = test.copy()
result['Survived'] = pred

In [ ]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
result.drop([col for col in result.columns if col not in ['PassengerId', 'Survived']], axis=1, inplace=True)
result.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [ ]:
result.to_csv('resultlinearsvcgrid.csv', index=False)
!cp resultlinearsvcgrid.csv "/content/gdrive/My Drive/Titanic Results"